# Handling Null Values

In [26]:
import numpy as np
import pandas as pd

In [33]:
x={"Roll_No":[1,2,3],
  "Name":["Satadru","Mayan","Saksham"],
  "Gender":["M","F",np.nan]};
x

{'Roll_No': [1, 2, 3],
 'Name': ['Satadru', 'Mayan', 'Saksham'],
 'Gender': ['M', 'F', nan]}

In [34]:
ds=pd.DataFrame(x);
ds

   Roll_No     Name Gender
0        1  Satadru      M
1        2    Mayan      F
2        3  Saksham    NaN

In [35]:
#isnull--will return true if null , else return false
ds.isnull()

   Roll_No   Name  Gender
0    False  False   False
1    False  False   False
2    False  False    True

But this will be manual inspection , to avoid this , we can use sum to check number of null values for each column like 
MATLAB

In [38]:
ds.isnull().sum()

Roll_No    0
Name       0
Gender     1
dtype: int64

In [41]:
#Drop the row where null value is coming
ms=ds.dropna();
ms

   Roll_No     Name Gender
0        1  Satadru      M
1        2    Mayan      F

In [43]:
#Now if we want to drop the column where null value is appearing , then use axis=1
ms=ds.dropna(axis=1)
ms

   Roll_No     Name
0        1  Satadru
1        2    Mayan
2        3  Saksham

In [44]:
#Replace the null values
ms=ds.fillna(1);
ms

   Roll_No     Name Gender
0        1  Satadru      M
1        2    Mayan      F
2        3  Saksham      1

# How to Filter a Pandas Dataframe Based on Null Values of a Column?

In [55]:
ms=ds.Gender.isnull()
print(ms)

0    False
1    False
2     True
Name: Gender, dtype: bool

In [56]:
ds[ms]

   Roll_No     Name Gender
2        3  Saksham    NaN

In [50]:
ds[~ms]

   Roll_No     Name Gender
0        1  Satadru      M
1        2    Mayan      F

In [53]:
# or you can use this too--
ds[ds.Gender.notnull()]

   Roll_No     Name Gender
0        1  Satadru      M
1        2    Mayan      F

# For more approaches , check this link:
# https://chrisalbon.com/#machine_learning